app/views/games/show.html.slim

SELECT "players".* FROM "players" WHERE "players"."game_id" = $1  [["game_id", 1]]
---
                      th
                        = @game.players.count{|player| player.normal?}