app/views/games/show.html.erb

SELECT "players".* FROM "players" WHERE "players"."game_id" = $1  [["game_id", 1]]
---
  <ul>
    <% @game.players.each do |player| %>