app/controllers/communities_controller.rb

  def create
    @community = Community.create(game_id: @current_player.game_id) #コミュニティー作成
    @hole = Hole.create(player_id: @current_player.id)
    @cards = shuffle(build) #シャッフルされた52枚のカード

    @community.game.players.each do |player|
      hole_cards = drawCard(2) #ホールカード作成
      hole_cards.each do |c|
        @hole.cards.create(suit:c.suit, number:c.number)
      end
    end
    community_cards = drawCard(5) #コミュニティカード作成
    community_cards.each do |c|
      @community.cards.create(suit:c.suit, number:c.number)
    end
    targetcards = @community.cards + @hole.cards
    @hole.hand = hand_judge(targetcards)
    @hole.save
---
INSERT INTO "communities" ("aasm_state", "game_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["aasm_state", "preflop"], ["game_id", 1], ["created_at", "2018-04-28 11:15:09.058914"], ["updated_at", "2018-04-28 11:15:09.058914"]]
INSERT INTO "holes" ("player_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["player_id", 1], ["created_at", "2018-04-29 03:31:49.167145"], ["updated_at", "2018-04-29 03:31:49.167145"]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."game_id" = $1  [["game_id", 1]]
INSERT INTO "cards" ("cardable_type", "cardable_id", "suit", "number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cardable_type", "Player"], ["cardable_id", 1], ["suit", "d"], ["number", 10], ["created_at", "2018-04-28 11:15:09.129532"], ["updated_at", "2018-04-28 11:15:09.129532"]]
UPDATE "holes" SET "hand" = $1, "updated_at" = $2 WHERE "holes"."id" = $3  [["hand", "TwoPairs"], ["updated_at", "2018-05-05 12:37:18.037936"], ["id", 10]]

  def show
    @community = Community.find(params[:id])
    @hole = @current_player.holes.last
---
SELECT  "communities".* FROM "communities" WHERE "communities"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "holes".* FROM "holes" WHERE "holes"."player_id" = $1 ORDER BY "holes"."id" DESC LIMIT $2  [["player_id", 1], ["LIMIT", 1]]

  def update
    @community = Community.find(params[:id])
    @community.aasm_state = 'showdown'
    @community.save
---
SELECT  "communities".* FROM "communities" WHERE "communities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "communities" SET "aasm_state" = $1, "updated_at" = $2 WHERE "communities"."id" = $3  [["aasm_state", "flop"], ["updated_at", "2018-04-28 11:56:38.356232"], ["id", 1]]