app/controllers/communities_controller.rb

SELECT  "holes".* FROM "holes" WHERE "holes"."player_id" = $1 ORDER BY "holes"."id" ASC LIMIT $2  [["player_id", 1], ["LIMIT", 1]]
---
  def show
    @community = Community.find(params[:id])
    @player_holes = []
    @community.holes.each do |hole|