app/controllers/games_controller.rb

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "players" SET "game_id" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["game_id", 1], ["updated_at", "2018-04-28 10:40:01.543525"], ["id", 1]]
---
  def update
    unless @current_player.tester?
      @game = Game.find(params[:id])
      if @game.players.any?{|player| player.admin? && player != @current_player}
        redirect_to game_path(@game), notice: '1テーブルにつき1管理者です'
        return
      end
    end
    @current_player.update(game_id: params[:id])