app/controllers/homes_controller.rb

INSERT INTO "players" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Kohei"], ["created_at", "2018-04-23 08:37:55.826067"], ["updated_at", "2018-04-23 08:37:55.826067"]]
INSERT INTO "communities" ("aasm_state", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["aasm_state", "preflop"], ["created_at", "2018-04-23 08:10:49.051418"], ["updated_at", "2018-04-23 08:10:49.051418"]]
INSERT INTO "cards" ("cardable_type", "cardable_id", "suit", "number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cardable_type", "Player"], ["cardable_id", 1], ["suit", "♥"], ["number", 8], ["created_at", "2018-04-22 15:58:23.671967"], ["updated_at", "2018-04-22 15:58:23.671967"]]
---
  def index
    @player = Player.create #プレイヤー一人作成
    @community = Community.create #コミュニティー作成
    @cards = shuffle(build) #シャッフルされた52枚のカード

    @player_cards = drawCard(2) #ホールカード作成
    @player_cards.each do |c|
      @player.cards.create(suit:c.suit, number:c.number)