app/controllers/players_controller.rb

INSERT INTO "players" ("name", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Kohei"], ["password", "Kohei"], ["created_at", "2018-04-28 09:14:49.392412"], ["updated_at", "2018-04-28 09:14:49.392412"]]
---
  def create
    @player = Player.new(player_params)
    if @player.save