app/controllers/sessions_controller.rb

SELECT  "players".* FROM "players" WHERE "players"."name" = $1 AND "players"."password" = $2 LIMIT $3  [["name", "Kohei"], ["password", "Kohei"], ["LIMIT", 1]]
---
  def create
    @player = Player.find_by(name: params[:name], password: params[:password])